In [1]:
import numpy as np
import pandas as pd

In [2]:
dic1={ "name":['harry','rohan','skillf','shubh'],
      "marks":[92,34,24,17],
      "city":['rampur','kolkata','bareilly','antarctica']
     }

In [3]:
df=pd.DataFrame(dic1)

In [4]:
df

     name  marks        city
0   harry     92      rampur
1   rohan     34     kolkata
2  skillf     24    bareilly
3   shubh     17  antarctica

In [5]:
df.to_csv('friends.csv')

In [7]:
df.to_csv('friends_false_index.csv',index=False)

In [8]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [9]:
df.tail(2)

     name  marks        city
2  skillf     24    bareilly
3   shubh     17  antarctica

In [10]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [11]:
mahi=pd.read_csv('mahi.csv')

In [12]:
mahi['seat no.']

0    4
1    5
2    7
3    9
Name: seat no., dtype: int64

In [13]:
mahi

   Unnamed: 0  train no.  seat no.        city
0           0      12345         4      rampur
1           1       2345         5     kolkata
2           2      56789         7    bareilly
3           3      98765         9  antarctica

In [14]:
mahi['seat no.][0]

SyntaxError: unterminated string literal (detected at line 1) (2291116947.py, line 1)

In [15]:
mahi['seat no.'][0]

4

In [16]:
mahi['seat no.'][0]=11

C:\Users\acer\AppData\Local\Temp\ipykernel_19920\2274400599.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mahi['seat no.'][0]=11

In [20]:
mahi['seat no.'][0]

11

In [24]:
mahi.index=['first','second','third','fourth']

In [26]:
mahi

        Unnamed: 0  train no.  seat no.        city
first            0      12345        11      rampur
second           1       2345         5     kolkata
third            2      56789         7    bareilly
fourth           3      98765         9  antarctica